{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"inputs_1:0": {"name": "inputs_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}]}}, "inputs:0": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/sub/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5000"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/conv1d_1_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/conv1d_1_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/conv1d_1_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/global_max_pooling1d_1_1/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/dense_2_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/dense_3_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/dense_3_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize/Maximum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5000"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/conv1d_1_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/conv1d_1_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/conv1d_1_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/global_max_pooling1d_1_1/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/dense_2_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/dense_3_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/dense_3_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize_1/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize_1/Maximum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/Cast", "op": "Cast", "input": ["inputs"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/Cast", "op": "Cast", "input": ["inputs_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/Cast", "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/Cast", "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/Cast", "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/Cast", "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/Less", "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/add", "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/Less", "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/add", "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/SelectV2", "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/SelectV2", "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/conv1d_1_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/GatherV2", "StatefulPartitionedCall/functional_4_1/functional_3_1/conv1d_1_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/conv1d_1_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/GatherV2", "StatefulPartitionedCall/functional_4_1/functional_3_3/conv1d_1_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/conv1d_1_1/convolution", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_1/conv1d_1_1/convolution/ExpandDims", "StatefulPartitionedCall/functional_4_1/functional_3_1/conv1d_1_1/convolution/ExpandDims_1", "StatefulPartitionedCall/functional_4_1/functional_3_1/conv1d_1_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/conv1d_1_1/convolution", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_3/conv1d_1_1/convolution/ExpandDims", "StatefulPartitionedCall/functional_4_1/functional_3_3/conv1d_1_1/convolution/ExpandDims_1", "StatefulPartitionedCall/functional_4_1/functional_3_3/conv1d_1_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/conv1d_1_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_1/conv1d_1_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/conv1d_1_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_3/conv1d_1_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/global_max_pooling1d_1_1/Max", "op": "Max", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_1/conv1d_1_1/BiasAdd", "StatefulPartitionedCall/functional_4_1/functional_3_1/global_max_pooling1d_1_1/Max/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/global_max_pooling1d_1_1/Max", "op": "Max", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_3/conv1d_1_1/BiasAdd", "StatefulPartitionedCall/functional_4_1/functional_3_3/global_max_pooling1d_1_1/Max/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/conv1d_1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_1/global_max_pooling1d_1_1/Max"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/conv1d_1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_3/global_max_pooling1d_1_1/Max"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/dense_2_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_1/conv1d_1_1/Relu", "StatefulPartitionedCall/functional_4_1/functional_3_1/dense_2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_4_1/functional_3_1/dense_2_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/dense_2_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_3/conv1d_1_1/Relu", "StatefulPartitionedCall/functional_4_1/functional_3_3/dense_2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_4_1/functional_3_3/dense_2_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/dense_3_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_1/dense_2_1/Relu", "StatefulPartitionedCall/functional_4_1/functional_3_1/dense_3_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_4_1/functional_3_1/dense_3_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/dense_3_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_3/dense_2_1/Relu", "StatefulPartitionedCall/functional_4_1/functional_3_3/dense_3_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_4_1/functional_3_3/dense_3_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize/Square", "op": "Square", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_1/dense_3_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize_1/Square", "op": "Square", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_3/dense_3_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize/Square", "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize_1/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize_1/Square", "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize_1/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize/Sum", "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize/Maximum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize_1/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize_1/Sum", "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize_1/Maximum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize_1/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize_1/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize", "op": "Mul", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_1/dense_3_1/BiasAdd", "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_4_1/functional_3_3/dense_3_1/BiasAdd", "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize_1/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize", "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/functional_4_1/lambda_1_1/mul", "StatefulPartitionedCall/functional_4_1/lambda_1_1/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/functional_4_1/lambda_1_1/sub/x", "StatefulPartitionedCall/functional_4_1/lambda_1_1/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_4_1/lambda_1_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/sub/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/GatherV2/ReadVariableOp", "shape": [5000, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/embedding_1_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/conv1d_1_1/convolution/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/conv1d_1_1/convolution/ExpandDims_1", "shape": [1, 5, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/conv1d_1_1/Squeeze", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/global_max_pooling1d_1_1/Max/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/dense_2_1/Cast/ReadVariableOp", "shape": [64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/dense_2_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/dense_3_1/Cast/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_1/dense_3_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize/Sum/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize/Maximum/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/GatherV2/ReadVariableOp", "shape": [5000, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/embedding_1_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/conv1d_1_1/convolution/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/conv1d_1_1/convolution/ExpandDims_1", "shape": [1, 5, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/conv1d_1_1/Squeeze", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/global_max_pooling1d_1_1/Max/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/dense_2_1/Cast/ReadVariableOp", "shape": [64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/dense_2_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/dense_3_1/Cast/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/functional_3_3/dense_3_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize_1/Sum/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/l2_normalize_1/Maximum/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_4_1/lambda_1_1/Sum/reduction_indices", "shape": [], "dtype": "int32"}]}]}